Revit 2027 API
ElectricalSystem.LoadClassificationAbbreviations Property
 The LoadClassification Abbreviations used in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LoadClassificationAbbreviations { get; }
Public ReadOnly Property LoadClassificationAbbreviations As String
	Get
public:
property String^ LoadClassificationAbbreviations {
	String^ get ();
}
member LoadClassificationAbbreviations : string with get
Property Value
String
Remarks
 This property is used to retrieve the LoadClassification Abbreviations of the Electrical System. There may be one or more load classification in use in which case they will be semi-colon delimited.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace